import random
discriptions = ['{"Кондеционеры":"5","Компьютеры":"10","Проектор":"2"}','{"Кондеционеры":"3","Компьютеры":"20","Проектор":"4"}','{"Проектор":"1","Компьютеры":"7"}','{"Кондеционеры":"2","Компьютеры":"5"}','{"Кондеционеры":"2","Компьютеры":"4"}','{"Компьютеры":"10"}','{"Кондеционеры":"2"}','{"Кондеционеры":"3"}','{"Компьютеры":"8"}','{"Компьютеры":"45"}','{"Кондеционеры":"1","Проектор":"1"}','{"Проектор":"4"}','{ }','{"Суперкомпьютер":"1"}','{"Компьютеры":"5"}','{"Кондеционеры":"4"}','{"Кондеционеры":"1"}','{"Компьютеры":"26"}','{"Компьютеры":"22"}','{"Кондеционеры":"1","Компьютеры":"2"}','{"Кондеционеры":"4","Компьютеры":"80"}']
uni = ['МГУ','МГТУ','Синергия','ВШЭ','МФТИ','МИФИ','МТУ','МГЛУ','МАИ','РГГУ']

def discription():
	i = random.randint(0,20)
	if (i==0 or i==1 or i==2):
		j = random.randint(0,100)
		if (j != 1):
			i = random.randint(3,20)
	return discriptions[i]

f = open('InsertClassroom.sql', 'w')
f.write('BEGIN;\n')
for i in range(1,1000001):
	f.write('INSERT INTO classroom values ('+str(i)+','+str(random.randint(100, 999))+','+str(random.randint(10, 500))+',\''+uni[random.randint(0,9)]+'\',\''+discription()+'\');\n')

f.write('COMMIT;\n')
f.close
